tags/20100430-TEST/eid-pki-ra-client-xkms/src/test/resources/exampleSigningRequest.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns4:BulkRegister xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="http://www.xkms.org/schema/xkms-2001-01-20" xmlns:ns4="http://www.w3.org/2002/03/xkms-xbulk" xmlns:ns5="http://xkms.og.ubizen.com/schema/xkms-2003-09/"><SignedPart Id="signed-part"><ns4:BatchHeader><BatchID>batch-id-f93fc306-a42c-4f9a-b890-2d01841440ab</BatchID><BatchTime>2010-04-09T08:55:54.578Z</BatchTime><NumberOfRequests>1</NumberOfRequests></ns4:BatchHeader><ns3:Respond><ns3:string>RetrievalMethod</ns3:string><ns3:string>X509Cert</ns3:string></ns3:Respond><ns4:Requests number="1"><ns4:Request><ns3:KeyID>key-id-a0719867-820d-4552-b4eb-766e468b9bf9</ns3:KeyID><ns2:KeyInfo><ns2:KeyName>http://xkms.og.ubizen.com/keyname?buc_id=8047651269</ns2:KeyName><ns4:PKCS10>MIIBqDCCARECAQAwaDELMAkGA1UEBhMCQkUxEDAOBgNVBAgTB0xpbWJ1cmcxEDAOBgNVBAcTB0hhc3NlbHQxGTAXBgNVBAoTEEFDQSBJVC1Tb2x1dGlvbnMxGjAYBgNVBAMTEUphbiBWYW4gZGVuIEJlcmdoMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCl9kIB3oD4AO4RBICIW8jkXXc/alX0cRHb+BrorI8g95eaN15VV4WTXsaw+Kx67xn8QkjgrI76z2dTaBhgaTFdzxYNO4Pqt+ajKGV4BP0Lquh7qyO1k/IT/KyyAdlHbJq8VD+Od/AnknnQminCw1TEPZfFck+HGGCvRrSeflRaXwIDAQABoAAwDQYJKoZIhvcNAQEFBQADgYEAJTlkGaB4CQIiZ+RP6NFYqe23ZpkU2GpSbUNJRGd7+a7RHQxodGQjZWpctP14R3C0iBHi6G8C7E5zhHWRyFtzxT3MVBFH33kuHxcRkAlDKZNAWyu8/pH4Z3DIUVriyhH2pUweqSXaaAaqmgocOH7vJzXLQ3WpNR1UsC/69kNpmpE=</ns4:PKCS10></ns2:KeyInfo><ns4:ProcessInfo><ns5:AttributeCertificate><ns5:ValidityInterval><ns5:NotBefore>2010-04-09T08:55:54.578Z</ns5:NotBefore><ns5:NotAfter>2011-07-09T08:55:54.578Z</ns5:NotAfter></ns5:ValidityInterval></ns5:AttributeCertificate></ns4:ProcessInfo></ns4:Request></ns4:Requests></SignedPart><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><Reference URI="#signed-part"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>d6Dp4/Lyswe+QPW6/uCpaocgpzI=</DigestValue></Reference></SignedInfo><SignatureValue>kbMKS960fgQKeq104JN/OemnJcwx8cX80iDGukp+EV6HBX9unw2s0jIJjk0XnRPPlnMNj3W4C8EC
pim0uhjQK+Rcq0r5oTG76WoRlqMI8p3Amw2hyFBkOOtvQIr2vLAR4S2P5Q4PKrVI7i9JctrbZNGv
JLeJg/nb/+fEASgSeW0=</SignatureValue><KeyInfo><X509Data><X509SubjectName>CN=Test User,OU=Unknown,O=Test,L=Unknown,ST=Unknown,C=BE</X509SubjectName><X509Certificate>MIICQzCCAaygAwIBAgIES7w8GTANBgkqhkiG9w0BAQUFADBmMQswCQYDVQQGEwJCRTEQMA4GA1UE
CBMHVW5rbm93bjEQMA4GA1UEBxMHVW5rbm93bjENMAsGA1UEChMEVGVzdDEQMA4GA1UECxMHVW5r
bm93bjESMBAGA1UEAxMJVGVzdCBVc2VyMB4XDTEwMDQwNzA4MDIzM1oXDTEwMDcwNjA4MDIzM1ow
ZjELMAkGA1UEBhMCQkUxEDAOBgNVBAgTB1Vua25vd24xEDAOBgNVBAcTB1Vua25vd24xDTALBgNV
BAoTBFRlc3QxEDAOBgNVBAsTB1Vua25vd24xEjAQBgNVBAMTCVRlc3QgVXNlcjCBnzANBgkqhkiG
9w0BAQEFAAOBjQAwgYkCgYEAzi24NHmrqpD4Rse4qLJ9eBrxvfglc8Ul31lhOL4huFuqjQsHEYvC
0xZazb4IExKgrybvWJGWkzu3NSoOKOyVq7Vfaq0F2Q2cuoxTI7H5PqO6yPRv9bOkYPweZnec10Di
TRalK5klI1r+HlG2g+tjn4zaL5BQdy1bMVnqvZuYb4sCAwEAATANBgkqhkiG9w0BAQUFAAOBgQAA
p3WILq3q/uABFp4fx3JLlghMSdRlzB1HFWTShTYgsKqKN0MQDfOWm3TgQ1Q0xnAv2anfWN2Q25/o
OEcGPR6gwQ9RU6dC4/OuuV61vwJzCnHXePFBcu+JvZuShFYQ3L+DDHII/4OMTG3EMKtQckm/EQFJ
+7zH5c8tyPBlrgbhpg==</X509Certificate></X509Data></KeyInfo></Signature></ns4:BulkRegister></S:Body></S:Envelope>