eid-pki-ra-client-xkms/src/test/resources/exampleSigningRequest.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns3:BulkRegister xmlns:ns2="http://xkms.og.ubizen.com/schema/xkms-2003-09/" xmlns:ns3="http://www.w3.org/2002/03/xkms-xbulk" xmlns:ns4="http://www.xkms.org/schema/xkms-2001-01-20" xmlns:ns5="http://www.w3.org/2000/09/xmldsig#"><SignedPart Id="signed-part"><ns3:BatchHeader><BatchID>batch-id-9da339d1-28a0-444d-9d2f-1b624497f248</BatchID><BatchTime>2010-10-07T06:50:33.033Z</BatchTime><NumberOfRequests>1</NumberOfRequests></ns3:BatchHeader><ns4:Respond><ns4:string>RetrievalMethod</ns4:string><ns4:string>X509Cert</ns4:string></ns4:Respond><ns3:Requests number="1"><ns3:Request><ns4:KeyID>key-id-a28dc274-c507-4637-ae8c-c1aeb7b8cf58</ns4:KeyID><ns4:Status>Indeterminate</ns4:Status><ns5:KeyInfo><ns5:KeyName>http://xkms.og.ubizen.com/keyname?buc_id=8047651269</ns5:KeyName><ns3:PKCS10>MIIBqDCCARECAQAwaDELMAkGA1UEBhMCQkUxEDAOBgNVBAgTB0xpbWJ1cmcxEDAOBgNVBAcTB0hhc3NlbHQxGTAXBgNVBAoTEEFDQSBJVC1Tb2x1dGlvbnMxGjAYBgNVBAMTEUphbiBWYW4gZGVuIEJlcmdoMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCl9kIB3oD4AO4RBICIW8jkXXc/alX0cRHb+BrorI8g95eaN15VV4WTXsaw+Kx67xn8QkjgrI76z2dTaBhgaTFdzxYNO4Pqt+ajKGV4BP0Lquh7qyO1k/IT/KyyAdlHbJq8VD+Od/AnknnQminCw1TEPZfFck+HGGCvRrSeflRaXwIDAQABoAAwDQYJKoZIhvcNAQEFBQADgYEAJTlkGaB4CQIiZ+RP6NFYqe23ZpkU2GpSbUNJRGd7+a7RHQxodGQjZWpctP14R3C0iBHi6G8C7E5zhHWRyFtzxT3MVBFH33kuHxcRkAlDKZNAWyu8/pH4Z3DIUVriyhH2pUweqSXaaAaqmgocOH7vJzXLQ3WpNR1UsC/69kNpmpE=</ns3:PKCS10></ns5:KeyInfo><ns3:ProcessInfo><ns2:Publish>true</ns2:Publish><ns2:AttributeCertificate><ns2:ValidityInterval><ns2:NotBefore>2010-10-07T06:50:33.031Z</ns2:NotBefore><ns2:NotAfter>2012-01-07T06:50:33.031Z</ns2:NotAfter></ns2:ValidityInterval></ns2:AttributeCertificate></ns3:ProcessInfo></ns3:Request></ns3:Requests></SignedPart><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><Reference URI="#signed-part"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>kA2oYRHCmCwO1/Z2mB5xgs6d+lo=</DigestValue></Reference></SignedInfo><SignatureValue>Zd5RGh2Ai00ALcUt1qph3+mKiXNs+udKXq9K4z8PB5iMH1z4qk0871AcuSmzl3aimWV9mkGk9eVZ
SfkuEHuMCzv37nL/U+EO6Z9nkUW7Z9aKIlJ5tb867Sk2qiv/7SxLUzR2SwHZQncO5nQSrmu+czGS
gxH3L8PEOUXLZw/wSwg=</SignatureValue><KeyInfo><X509Data><X509SubjectName>CN=Test User,OU=Unknown,O=Test,L=Unknown,ST=Unknown,C=BE</X509SubjectName><X509Certificate>MIICQzCCAaygAwIBAgIES7w8GTANBgkqhkiG9w0BAQUFADBmMQswCQYDVQQGEwJCRTEQMA4GA1UE
CBMHVW5rbm93bjEQMA4GA1UEBxMHVW5rbm93bjENMAsGA1UEChMEVGVzdDEQMA4GA1UECxMHVW5r
bm93bjESMBAGA1UEAxMJVGVzdCBVc2VyMB4XDTEwMDQwNzA4MDIzM1oXDTEwMDcwNjA4MDIzM1ow
ZjELMAkGA1UEBhMCQkUxEDAOBgNVBAgTB1Vua25vd24xEDAOBgNVBAcTB1Vua25vd24xDTALBgNV
BAoTBFRlc3QxEDAOBgNVBAsTB1Vua25vd24xEjAQBgNVBAMTCVRlc3QgVXNlcjCBnzANBgkqhkiG
9w0BAQEFAAOBjQAwgYkCgYEAzi24NHmrqpD4Rse4qLJ9eBrxvfglc8Ul31lhOL4huFuqjQsHEYvC
0xZazb4IExKgrybvWJGWkzu3NSoOKOyVq7Vfaq0F2Q2cuoxTI7H5PqO6yPRv9bOkYPweZnec10Di
TRalK5klI1r+HlG2g+tjn4zaL5BQdy1bMVnqvZuYb4sCAwEAATANBgkqhkiG9w0BAQUFAAOBgQAA
p3WILq3q/uABFp4fx3JLlghMSdRlzB1HFWTShTYgsKqKN0MQDfOWm3TgQ1Q0xnAv2anfWN2Q25/o
OEcGPR6gwQ9RU6dC4/OuuV61vwJzCnHXePFBcu+JvZuShFYQ3L+DDHII/4OMTG3EMKtQckm/EQFJ
+7zH5c8tyPBlrgbhpg==</X509Certificate></X509Data></KeyInfo></Signature></ns3:BulkRegister></S:Body></S:Envelope>
